# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Isaac Souza\Dropbox\SharedWorkspace\PSoC Creator Projects\Testes\STRDS.cydsn\STRDS.cyprj
# Date: Thu, 31 Jul 2014 23:12:25 GMT
#set_units -time ns
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {MAD_2_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 3 5} [list [get_pins {ClockBlock/aclk_glb_0}]]
create_clock -name {MAD_2_theACLK(fixed-function)} -period 83.333333333333329 -waveform {0 41.6666666666667} [get_pins {ClockBlock/aclk_glb_ff_0}]
create_generated_clock -name {MAD_1_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 3 5} [list [get_pins {ClockBlock/aclk_glb_1}]]
create_clock -name {MAD_1_theACLK(fixed-function)} -period 83.333333333333329 -waveform {0 41.6666666666667} [get_pins {ClockBlock/aclk_glb_ff_1}]
create_generated_clock -name {timer_clock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 24001 48001} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_clock -name {timer_clock(fixed-function)} -period 1000000 -waveform {0 500000} [get_pins {ClockBlock/dclk_glb_ff_0}]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\Isaac Souza\Dropbox\SharedWorkspace\PSoC Creator Projects\Testes\STRDS.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Isaac Souza\Dropbox\SharedWorkspace\PSoC Creator Projects\Testes\STRDS.cydsn\STRDS.cyprj
# Date: Thu, 31 Jul 2014 23:12:18 GMT
